[
    {
        "nom": "Booki",
        "label": "p1",
        "objectif": " Transformer une maquette en site web avec HTML CSS",
        "contexte": " Vous débutez votre alternance en tant que développeur web au sein de la start-up Booki. Vous êtes chargé d'intégrer l'interface du site avec du code HTML et CSS.",
        "duree" : "90h",
        "animations" : "hideAnimations",
        "rendu" : ["/imgprojets/booki/booki.webp","/imgprojets/booki/booki2.webp","/imgprojets/booki/booki3.webp"],
        "techno" : [""]
      },
      {
      "nom": "OhMyFood",
      "label": "p2",
      "objectif": " Dynamiser une page web avec des animations CSS",
      "contexte": " Vous avez intégré Ohmyfood en tant que développeur junior. Il s’agit d’une jeune startup qui voudrait s'imposer sur le marché de la restauration. Déjà présente à New-York, elle souhaite désormais faire sa place à Paris. Votre mission est de développer un site “mobile first” qui répertorie les menus de restaurants gastronomiques",
      "duree" : "70h",
      "animations" : "hideAnimations",
      "rendu" : ["/imgprojets/ohmyfood/ohmyfood.webp","/imgprojets/ohmyfood/ohmyfood2.webp","/imgprojets/ohmyfood/ohmyfood3.webp"],
      "techno" : [""]
    },
    {
      "nom": "La Panthère",
      "label": "p3",
      "objectif": " Optimiser un site web existant",
      "contexte": "Vous travaillez pour l'agence La Panthère, une grande agence de web design basée à Lyon. L’activité de l’entreprise a bien démarré mais aujourd’hui, elle est en perte de vitesse. La fondatrice de l’entreprise, Sophie, cherche une solution pour faire repartir l’activité. En tapant “Entreprise web design Lyon” sur Internet, elle s’aperçoit que le site de l’agence apparaît seulement en deuxième page des moteurs de recherche. La mission est : Analyser l’état actuel de SEO du site, améliorer le SEO et enfin comparer les resultats avant/après",
      "duree" : "30h",
      "animations" : "hideAnimations",
      "rendu" : ["/imgprojets/lapanthere/lapanthere.webp","/imgprojets/lapanthere/lapanthere2.webp"],
      "techno" : [""]
    },
    {
      "nom": "Kanap",
      "label": "p4",
      "objectif": " Construire un site e-commerce en JavaScript",
      "contexte": "Vous êtes en poste dans une agence de développement web depuis quelques semaines maintenant. Après avoir réalisé avec succès l’intégration de quelques sites web (HTML/CSS), on vous confie une nouvelle mission. Votre client est Kanap, une marque de canapés qui vend ses produits depuis sa boutique exclusivement. Aujourd’hui, celle-ci souhaiterait avoir une plateforme de e-commerce en plus de sa boutique physique pour vendre ses produits sur Internet.",
      "duree" : "90h",
      "animations" : "hideAnimations",
      "rendu" : ["/imgprojets/kanap/kanap.webp","/imgprojets/kanap/kanap2.webp","/imgprojets/kanap/kanap3.webp","/imgprojets/kanap/kanap4.webp"],
      "techno" : [""]
    },
    {
      "nom": "Hot Takes",
      "label": "p5",
      "objectif": " Construire une API sécurisée pour une application d'avis gastronomiques",
      "contexte": "Vous avez passé la dernière année en tant que développeur back-end indépendant et vous avez travaillé sur plusieurs projets de tailles et de difficultés variées. La semaine dernière, vous avez reçu un message sur votre plateforme de freelance vous demandant de l'aide pour un nouveau projet. Les sauces piquantes sont de plus en plus populaires, en grande partie grâce à la série YouTube « Hot Ones » . C’est pourquoi ce nouveau client, la marque de condiments à base de piment Piiquante, veut développer une application web de critique des sauces piquantes appelée « Hot Takes » . Si la responsable produit de Piiquante souhaite à terme transformer l'application d'évaluation en une boutique en ligne, elle souhaite que la première version soit une « galerie de sauces » permettant aux utilisateurs de télécharger leurs sauces piquantes préférées et de liker ou disliker les sauces que d'autres partagent. Le front-end de l'application a été développé à l'aide d'Angular et a été précompilé après des tests internes, mais Piiquante a besoin d'un développeur back-end pour construire l'API. Le délai est raisonnable, vous décidez donc d'accepter le projet.",
      "duree" : "50h",
      "animations" : "hideAnimations",
      "rendu" : ["/imgprojets/hottakes/hottakes.webp","/imgprojets/hottakes/hottakes2.webp"],
      "techno" : [""]
    },
    {
        "nom": "Kasa",
        "label": "p6",
        "objectif": " Créez une application web de location immobilière avec React",
        "contexte": "Kasa vous recrute en tant que développeur front-end en freelance pour développer sa nouvelle plateforme web. Kasa est dans le métier de la location d’appartements entre particuliers depuis près de 10 ans maintenant. Avec plus de 500 annonces postées chaque jour, Kasa fait partie des leaders de la location d’appartements entre particuliers en France. Le site de Kasa a été codé il y a maintenant plus de 10 ans en ASP.NET avec un code legacy important. Laura, la CTO, a donc lancé une refonte totale pour passer à une stack complète en JavaScript avec NodeJS côté back-end, et React côté front-end.",
        "duree" : "50h",
        "animations" : "hideAnimations",
        "rendu" : ["/imgprojets/kasa/KASA.webp","/imgprojets/kasa/KASA2.webp","/imgprojets/kasa/KASA3.webp","/imgprojets/kasa/KASA4.webp", "/imgprojets/kasa/KASA5.webp","/imgprojets/kasa/KASA6.webp"],
        "techno" : [""]
      }
      ,
    {
        "nom": "Animations",
        "label": "CSS",
        "objectif": " S'entraîner au CSS",
        "contexte": "Je souhaitais travailler un peu les animations, dans le premier cas j'ai voulu animer un oiseau cartoonesque dans une boucle qui rendrais le mouvement a peu prêt réaliste, dans le second cas j'ai voulu faire une sorte de diorama animé dans un cadre simulant un player vidéo, tout à été réalisé à base de blocs HTML et de CSS",
        "duree" : "50h",
        "animations" : "displayAnimations",
        "techno" : [""]
      }
  ]
  